#-------------------------------------------------------------------
#Імпорт бібліотек
#-------------------------------------------------------------------
import time
from os import*
#-------------------------------------------------------------------
#Змінні
#-------------------------------------------------------------------
falsetest=0
truetest=0
iqtest=False
risttest=False
oresttest=False
iq=0
rist=0
tupi=0
litak=0
drug=0
#-------------------------------------------------------------------
#Запитання #1
#-------------------------------------------------------------------
print("Це тест на Мар'яна із 5 запитань")
time.sleep(2)
print("Тому давай розпочнемо")
time.sleep(3)
system("cls")

time.sleep(2)
print("Запитання #1")
time.sleep(1.5)
print("Яке твоє приблизне iq?")
print("Відповідь потрібно давати у цілих числах а не у буквах")
time.sleep(2)

while True: 
    try:
        iq=int(input("Писати тут-->"))
        iqtest=True
    except ValueError:
        qitest=False
    
    if iqtest==True:
        time.sleep(1.5)
        system("cls")
        break
    else:
        print("Я ж попросив")
        time.sleep(2)
        system("cls")

if iq>=60:
    falsetest+=1
elif iq<=0:
    oresttest=True
else:
    truetest+=1
#-------------------------------------------------------------------------
#Запитання #2
#-------------------------------------------------------------------------
print("Запитання #2")
time.sleep(1.5)
print("Який твій ріст?")
print("Відповідь зарахується у см")
time.sleep(2)
while True:
    try:
        rist=int(input("Писати тут-->"))
        risttest=True
    except ValueError:
        risttest=False

    if risttest==True:
        time.sleep(1.5)
        system("cls")
        break
    else:
        print("Попрошу дати відповідь у цілих числах")
        time.sleep(2)
        system("cls")

if rist>=153:
    falsetest+=1
else:
    truetest+=1
#---------------------------------------------------------------------------
#Запитання #3
#---------------------------------------------------------------------------
time.sleep(2)
print("Запитання #3")
time.sleep(1.5)
print("Ти граєш у тупі ігри?")
print('Відповідь потрібно давати лише "Так" або "Ні"')
time.sleep(2)

while True:
    tupi=input("Писати тут-->")

    if tupi=="Так" or tupi=="Ні":
        time.sleep(1.5)
        system("cls")
        break
    else:
        print("Я спеціально для тебе надав інструкцію але ти її не дотримуєшся >:(")
        time.sleep(5)
        print("Спробуй ще раз але тепер дотримайся інструкції")
        time.sleep(3)
        system("cls")
        print('Відповідь потрібно давати лише "Так" або "Ні"')
        time.sleep(2)

if tupi=="Ні":
    falsetest+=1
else:
    truetest+=1
#----------------------------------------------------------------------------
#Запитання #4
#----------------------------------------------------------------------------
time.sleep(2)
print("Запитання #4")
time.sleep(1.5)
print("Коли ти лягаєш спати, ти ставиш телефон на режим у літаку?")
print('Відповідь потрібно давати лише "Так" або "Ні"')
time.sleep(2)

while True:
    litak=input("Писати тут-->")

    if litak=="Так" or litak=="Ні":
        time.sleep(1.5)
        system("cls")
        break
    else:
        print("Я спеціально для тебе надав інструкцію але ти її не дотримуєшся >:(")
        time.sleep(5)
        print("Спробуй ще раз але тепер дотримайся інструкції")
        time.sleep(3)
        system("cls")
        print('Відповідь потрібно давати лише "Так" або "Ні"')
        time.sleep(2)

if litak=="Ні":
    falsetest+=1
else:
    truetest+=1
#-------------------------------------------------------------------------------
#Запитання #5
#-------------------------------------------------------------------------------
time.sleep(2)
print("Запитання #5")
time.sleep(1.5)
print("Карен твій найкращий друг?")
print('Відповідь потрібно давати лише "Так" або "Ні"')
time.sleep(2)

while True:
    drug=input("Писати тут-->")

    if drug=="Так" or drug=="Ні":
        time.sleep(1.5)
        system("cls")
        break
    else:
        print("Я спеціально для тебе надав інструкцію але ти її не дотримуєшся >:(")
        time.sleep(5)
        print("Спробуй ще раз але тепер дотримайся інструкції")
        time.sleep(3)
        system("cls")
        print('Відповідь потрібно давати лише "Так" або "Ні"')
        time.sleep(2)

if drug=="Ні":
    falsetest+=1
else:
    truetest+=1
#----------------------------------------------------------------------------
#Результат
#----------------------------------------------------------------------------
time.sleep(2)
print("Ваш результат:")
time.sleep(3)
if oresttest==True:
    print("Вітаю!")
    time.sleep(3)
    print("Ви Орест Громов!")
    time.sleep(4)
    print("Буль ласка ви стрибніть  з вікна ;)")
    while True:
        x=0
else:
    if falsetest>truetest:
        print("Вітаю!")
        time.sleep(3)
        print("Ви не Мар'ян!")
        while True:
            x=0
    else:
        print("Вітаю!")
        time.sleep(3)
        print("Ви Мар'ян!")
        while True:
            x=0
#-------------------------------------------------------------------------
#Код був написаний Karbyrator
#Сторінка на github: https://github.com/YurashHTML
#-------------------------------------------------------------------------